{
  "_comment_1": [
    "# Typist 3.0 - improved typing tutor program for UNIX systems",
    "# Copyright (C) 1998-2018  Simon Baldwin (simon_baldwin@yahoo.com)"
  ],
  "typist": {
    "version": 2,
    "locale": "en_US.UTF-8",

    "seriesName": "Lesson series S",
    "seriesDescription": "Speed drills (S1 - S4)",

    "_comment_2": "# BEGIN MENU DEFINITIONS SECTION",

    "seriesMenu": {
      "title": "This series contains the following lessons",
      "entries": [
        {
          "title": "Lesson S1     Speed tests",
          "lessons": ["S1.1", "S1.2", "S1.3", "S1.4", "S1.5", "S1.6", "S1.7"]
        },
        {
          "title": "Lesson S2     Speed tests",
          "lessons": ["S2.1", "S2.2", "S2.3", "S2.4", "S2.5", "S2.6", "S2.7", "S2.8", "S2.9", "S2.10", "S2.11", "S2.12", "S2.13", "S2.14", "S2.15", "S2.16", "S2.17", "S2.18", "S2.19", "S2.20"]
        },
        {
          "title": "Lesson S3     Speed tests",
          "lessons": ["S3.1", "S3.2", "S3.3", "S3.4", "S3.5"]
        },
        {
          "title": "Lesson S4     Speed tests",
          "lessons": ["S4.1", "S4.2", "S4.3", "S4.4", "S4.5", "S4.6", "S4.7", "S4.8"]
        },
        {
          "title": null
        },
        {
          "title": "Finished      Leave this series",
          "lessons": null
        }
      ]
    },

    "_comment_3": "# END MENU DEFINITIONS SECTION",

    "_comment_4": "# BEGIN LESSONS DATA SECTION",

    "S1.1": {
      "title": "Lesson S1.1: Tutorial",
      "type": "Tutorial",
      "text": [
        "                        Speed Practice Series",
        "",
        "The S series of lessons is designed to help you improve your typing speed",
        "and accuracy.  It is assumed that you have already learned how to touch",
        "type either from a previous course in touch typing or from the T series of",
        "these lessons.",
        "",
        "You can use this series even if you do not know how to touch type.  But, it is",
        "recommended that you at least learn to touch type most of the letters of the",
        "alphabet before starting this series.  When you encounter a letter or symbol",
        "which you have not learned, you will have to look.  This is a very bad habit to",
        "get into and is hard to break.  (You needn't worry if you only need to glance",
        "down for unusual keys, like the dollar sign.)"
      ]
    },

    "S1.2": {
      "title": "Lesson S1.2: Tutorial",
      "type": "Tutorial",
      "text": [
        "                        Rules of the Game",
        "",
        "I will display a paragraph on the screen.  You should then type the entire",
        "paragraph as quickly and as accurately as possible.   As you type each",
        "character, I will immediately check it for accuracy.  If it was right, I will",
        "move the cursor on the next character.  But, if you made a mistake, I will mark",
        "it with an error character.  You can ignore the error and continue going; or,",
        "you can backup and correct it with the DELETE or BACKSPACE keys.  I will still",
        "count it as an error, though.",
        "",
        "I will also be timing you.  From the time you type the first character until",
        "you type the last one, my stop watch will be going.  At the end of the para-",
        "graph, I will tell you your rating, in words-per-minute (WPM).",
        "",
        "If you made too many mistakes, try the next paragraph slower.  If you made no",
        "mistakes or only one or two, try the next one faster."
      ]
    },

    "S1.3": {
      "title": "Lesson S1.3: Speed Test",
      "type": "Paragraph",
      "instructions": "First, a quick warm-up.",
      "text": "The quick brown fox jumped over the lazy dogs."
    },

    "S1.4": {
      "title": "Lesson S1.4: Speed Test",
      "type": "Paragraph",
      "instructions": "Once more:",
      "text": "The quick brown fox jumped over the lazy dogs."
    },

    "S1.5": {
      "title": "Lesson S1.5: Speed Test",
      "type": "Paragraph",
      "instructions": "Watch out for the blank lines.",
      "text": [
        "Dear Sirs:",
        "",
        "I have just purchased a Heathkit H89 computer system and would",
        "like to order two boxes of diskettes for it.  This system uses",
        "5 1/4 inch, hard-sectored, ten-sector, single-sided, single-",
        "density diskettes.",
        "",
        "Enclosed is my check for $45.00.  Please rush this order, as I",
        "can not use my system before they arrive.",
        "",
        "Sincerely,",
        "",
        "Mr. Smith"
      ]
    },

    "S1.6": {
      "title": "Lesson S1.6: Speed Test",
      "type": "Paragraph",
      "text": [
        "Dear Sirs:",
        "",
        "Thank you for sending the diskettes so promptly.  How-",
        "ever, the diskettes which you sent are for soft-sectored",
        "drives.  As I stated in my original letter my system",
        "accepts only ten-sector, hard-sectored diskettes.",
        "",
        "I will return these two boxes as soon as I receive the",
        "correct ones.",
        "",
        "Sincerely,",
        "",
        "Mr. Smith"
      ]
    },

    "S1.7": {
      "title": "Lesson S1.7: Speed Test",
      "type": "Paragraph",
      "text": [
        "Dear Mr. Smith:",
        "",
        "Thank you for informing us that the diskettes which you pur-",
        "chased from us are not satisfactory.  We are sorry for the",
        "inconvenience you have been caused in this transaction.",
        "",
        "We shall be glad to replace the diskettes you now have or to",
        "allow you to select a different brand.  If you will let us know",
        "your wishes we shall be glad to give the matter our immediate",
        "attention.",
        "",
        "We hope you will give us the opportunity to prove to you that",
        "this incident is most unusual and that we do strive to render",
        "to our customers an efficient and courteous service at all",
        "times."
      ]
    },

    "S2.1": {
      "title": "Lesson S2.1: Tutorial",
      "type": "Tutorial",
      "text": [
        "In this lesson we will practice some quotes by some famous (and not so",
        "famous) people."
      ]
    },

    "S2.2": {
      "title": "Lesson S2.2: Speed Test",
      "type": "Paragraph",
      "instructions": "Marcus Aurelius",
      "text": "A man can live well even in a palace."
    },

    "S2.3": {
      "title": "Lesson S2.3: Speed Test",
      "type": "Paragraph",
      "instructions": "Ralph Waldo Emerson",
      "text": "My chief want in life is someone who shall make me do what I can."
    },

    "S2.4": {
      "title": "Lesson S2.4: Speed Test",
      "type": "Paragraph",
      "instructions": "Elizabeth Barrett Browning",
      "text": [
        "No man can be called friendless when he has God and the",
        "companionship of good books."
      ]
    },

    "S2.5": {
      "title": "Lesson S2.5: Speed Test",
      "type": "Paragraph",
      "instructions": "Ralph Waldo Emerson",
      "text": "I like the silent church before the service begins better than any preaching."
    },

    "S2.6": {
      "title": "Lesson S2.6: Speed Test",
      "type": "Paragraph",
      "instructions": "George Washington",
      "text": "True friendship is a plant of slow growth."
    },

    "S2.7": {
      "title": "Lesson S2.7: Speed Test",
      "type": "Paragraph",
      "instructions": "Aristotle",
      "text": "There is a foolish corner in the brain of the wisest men."
    },

    "S2.8": {
      "title": "Lesson S2.8: Speed Test",
      "type": "Paragraph",
      "instructions": "Goethe",
      "text": "Tell me what you are busy about, and I will tell you what you are."
    },

    "S2.9": {
      "title": "Lesson S2.9: Speed Test",
      "type": "Paragraph",
      "instructions": "Gelett Burgess",
      "text": [
        "If in the last few years you haven't discarded a major opinion or",
        "acquired a new one, check your pulse.  You may be dead."
      ]
    },

    "S2.10": {
      "title": "Lesson S2.10: Speed Test",
      "type": "Paragraph",
      "instructions": "James B. Conant",
      "text": [
        "Democracy is a small hard core of common agreement, surrounded",
        "by a rich variety of individual differences."
      ]
    },

    "S2.11": {
      "title": "Lesson S2.11: Speed Test",
      "type": "Paragraph",
      "instructions": "Albert Einstein",
      "text": "I never think of the future.  It comes soon enough."
    },

    "S2.12": {
      "title": "Lesson S2.12: Speed Test",
      "type": "Paragraph",
      "instructions": "Harry S. Truman",
      "text": [
        "Men often mistake notoriety for fame, and would rather be",
        "remarked for their vices than not be noticed at all."
      ]
    },

    "S2.13": {
      "title": "Lesson S2.13: Speed Test",
      "type": "Paragraph",
      "instructions": "Will Rogers",
      "text": [
        "I could study all my life and not think up half the amount",
        "of funny things they can think of in one session of Congress."
      ]
    },

    "S2.14": {
      "title": "Lesson S2.14: Speed Test",
      "type": "Paragraph",
      "instructions": "Ralph Waldo Emerson",
      "text": "Hospitality consists in a little fire, a little food and an immense quiet."
    },

    "S2.15": {
      "title": "Lesson S2.15: Speed Test",
      "type": "Paragraph",
      "instructions": "H. L. Mencken",
      "text": "Puritanism is the haunting fear that someone, somewhere, may be happy."
    },

    "S2.16": {
      "title": "Lesson S2.16: Speed Test",
      "type": "Paragraph",
      "instructions": "William James",
      "text": "When you have to make a choice and don't make it, that is in itself a choice."
    },

    "S2.17": {
      "title": "Lesson S2.17: Speed Test",
      "type": "Paragraph",
      "instructions": "James Holt McGravran",
      "text": [
        "There is a way of transferring funds that is even faster",
        "than electronic banking.  It is called marriage."
      ]
    },

    "S2.18": {
      "title": "Lesson S2.18: Speed Test",
      "type": "Paragraph",
      "instructions": "Woody Allen",
      "text": "Showing up is 80 percent of life."
    },

    "S2.19": {
      "title": "Lesson S2.19: Speed Test",
      "type": "Paragraph",
      "instructions": "Robert Frost",
      "text": "A poem begins in delight and ends in wisdom."
    },

    "S2.20": {
      "title": "Lesson S2.20: Speed Test",
      "type": "Paragraph",
      "instructions": "Louis Pasteur",
      "text": [
        "When I approach a child, he inspires in me two sentiments:  tenderness",
        "for what he is, and respect for what he may become."
      ]
    },

    "S3.1": {
      "title": "Lesson S3.1: Tutorial",
      "type": "Tutorial",
      "text": [
        "In this lesson you will be given several excerpts from the classics.",
        "Take your time and type them carefully."
      ]
    },

    "S3.2": {
      "title": "Lesson S3.2: Speed Test",
      "type": "Paragraph",
      "instructions": "A Christmas Carol, Stave One, Marley's Ghost",
      "text": [
        "Now, it is a fact, that there was nothing at all par-",
        "ticular about the knocker on the door, except that it",
        "was very large.  It is also a fact, that Scrooge had",
        "seen it, night and morning, during his whole residence",
        "in that place; also that Scrooge has as little of what",
        "is called fancy about him as any man in the city of",
        "London, even including--which is a bold word--the",
        "corporation, aldermen, and livery.  Let it also be",
        "borne in mind that Scrooge had not bestowed one",
        "thought on Marley, since his last mention of his",
        "seven year's dead partner that afternoon.  And then",
        "let any man explain to me, if he can, how it happened",
        "that Scrooge, having his key in the lock of the door,",
        "saw in the knocker, without its undergoing any inter-",
        "mediate process of change--not a knocker, but Mar-",
        "ley's face."
      ]
    },

    "S3.3": {
      "title": "Lesson S3.3: Speed Test",
      "type": "Paragraph",
      "instructions": "Gulliver's Travels, Chapter One, A Voyage to Lilliput",
      "text": [
        "When I awaked it was just daylight.  I attempted to rise, but I",
        "found my arms and legs were strongly fastened on each side to",
        "the ground; and my hair, which was long and thick, tied to the",
        "ground in the same manner.  I likewise felt several slender",
        "ligatures across my body, from my armpits to my thighs.  I",
        "could only look upward; the sun began to grow hot, and the",
        "light offended my eyes.  I heard a confused noise about me;",
        "but in the posture I lay could see nothing except the sky.  In a",
        "little time I felt something alive moving on my left leg,",
        "which, advancing gently forward over my breast, came almost up",
        "to my chin; when bending my eyes downward as much as I could, I",
        "perceived it to be a human creature not six inches high, with a",
        "bow and arrow in his hands, and a quiver at his back.  In the",
        "mean time I felt at least forty more of the same kind (as I",
        "conjectured) following the first."
      ]
    },

    "S3.4": {
      "title": "Lesson S3.4: Speed Test",
      "type": "Paragraph",
      "instructions": "Treasure Island, Chapter IV, \"The Sea Chest\", by Stevenson.",
      "text": [
        "I lost no time, of course, in telling my mother all that",
        "I knew, and perhaps should have told her long before,",
        "and we saw ourselves at once in a difficult and dangerous",
        "position.  Some of the man's money--if he had any--was",
        "certainly due to us; but it was not likely that our",
        "captain's shipmates, above all the two specimens seen by",
        "me, Black Dog and the blind beggar, would be inclined to",
        "give up their booty in payment of the dead man's debts.",
        "The captain's order to mount at once and ride for Dr.",
        "Livesey would have left my mother alone and unprotected,",
        "which was not to be thought of.  Indeed, it seemed",
        "impossible for either of us to remain much longer in the",
        "house:  the fall of coals in the kitchen grate, the very",
        "ticking of the clock, filled us with alarms."
      ]
    },

    "S3.5": {
      "title": "Lesson S3.5: Speed Test",
      "type": "Paragraph",
      "instructions": "Treasure Island, Chapter IV, \"The Sea Chest\", by Stevenson.",
      "text": [
        "The neighborhood, to our ears, seemed haunted by",
        "approaching footsteps; and what between the dead",
        "body of the captain on the parlor floor, and the thought",
        "of that detestable blind beggar hovering near at hand,",
        "and ready to return, there were moments when, as the",
        "saying goes, I jumped in my skin for terror.  Something",
        "must speedily be resolved upon; and it occurred to us at",
        "last to go forth together and seek help in the neighbor-",
        "ing hamlet.  No sooner said than done.  Bareheaded as we",
        "were, we ran out at once in the gathering evening and",
        "the frosty fog."
      ]
    },

    "S4.1": {
      "title": "Lesson S4.1: Tutorial",
      "type": "Tutorial",
      "text": [
        "In this lesson you will be given several soliloquies from Shakespeare's plays.",
        "The spelling and punctuation are quite hard.  Take your time and type them",
        "carefully."
      ]
    },

    "S4.2": {
      "title": "Lesson S4.2: Speed Test",
      "type": "Paragraph",
      "instructions": "Romeo and Juliet, Act II, Scene II (Capulet's Garden).",
      "text": [
        "But, soft! what light through yonder window breaks?",
        "It is the east, and Juliet is the sun!--",
        "Arise, fair sun, and kill the envious moon,",
        "Who is already sick and pale with grief,",
        "That thou her maid art far more fair than she:",
        "Be not her maid, since she is envious;",
        "Her vestal livery is but sick and green,",
        "And none but fools do wear it; cast it off.--",
        "It is my lady; O, it is my love!",
        "O, that she knew she were!--",
        "She speaks, yet she says nothing:  what of that?",
        "Her eye discourses, I will answer it.--",
        "I am too bold, 'tis not to me she speaks:"
      ]
    },

    "S4.3": {
      "title": "Lesson S4.3: Speed Test",
      "type": "Paragraph",
      "text": [
        "Two of the fairest stars in all the heaven,",
        "Having some business, do entreat her eyes",
        "To twinkle in their spheres till they return.",
        "What if her eyes were there, they in her head?",
        "The brightness of her cheek would shame those stars,",
        "As daylight doth a lamp; her eyes in heaven",
        "Would through the airy region stream so bright",
        "That birds would sing, and think it were not night.--",
        "See how she leans her cheek upon her hand!",
        "O, that I were a glove upon that hand,",
        "That I might touch that cheek!"
      ]
    },

    "S4.4": {
      "title": "Lesson S4.4: Speed Test",
      "type": "Paragraph",
      "instructions": "Julius Caesar, Act III, Scene II (The Forum).",
      "text": [
        "Friends, Romans, countrymen, lend me your ears;",
        "I come to bury Caesar, not to praise him.",
        "The evil that men do lives after them;",
        "The good is oft interred with their bones;",
        "So let it be with Caesar:  The noble Brutus",
        "Hath told you Caesar was ambitious:",
        "If it were so, it was a grievous fault;",
        "And grievously hath Caesar answer'd it.",
        "Here, under leave of Brutus and the rest,--",
        "For Brutus is an honourable man;",
        "So are they all, all honourable men,--",
        "Come I to speak in Caesar's funeral.",
        "He was my friend, faithful and just to me;",
        "But Brutus says he was ambitious;",
        "And Brutus is an honourable man."
      ]
    },

    "S4.5": {
      "title": "Lesson S4.5: Speed Test",
      "type": "Paragraph",
      "text": [
        "He hath brought many captives home to Rome.",
        "Whose ransoms did the general coffers fill:",
        "Did this in Caesar seem ambitious?",
        "When that the poor have cried, Caesar hath wept:",
        "Ambition should be made of sterner stuff:",
        "Yet Brutus says he was ambitious;",
        "And Brutus is an honourable man.",
        "You all did see that on the Lupercal",
        "I thrice presented him a kingly crown,",
        "Which he did thrice refuse:  was this ambition?",
        "Yet Brutus says he was ambitious;",
        "And, sure, he is an honourable man."
      ]
    },

    "S4.6": {
      "title": "Lesson S4.6: Speed Test",
      "type": "Paragraph",
      "text": [
        "I speak not to disprove what Brutus spoke,",
        "But here I am to speak what I do know.",
        "You all did love him once,--not without cause:",
        "What cause withholds you, then, to mourn for him?",
        "O judgement, thou art fled to brutish beasts,",
        "And men have lost their reason!--Bear with me;",
        "My heart is in the coffin there with Caesar,",
        "And I must pause till it come back to me."
      ]
    },

    "S4.7": {
      "title": "Lesson S4.7: Speed Test",
      "type": "Paragraph",
      "instructions": "The Merchant of Venice, Act IV, Scene I (A Court of Justice).",
      "text": [
        "The quality of mercy is not strain'd;",
        "It droppeth as the gentle rain from heaven",
        "Upon the place beneath: it is twice bless'd;",
        "It blesseth him that gives and him that takes:",
        "'Tis mightiest in the mightiest; it becomes",
        "The throned monarch better than his crown;",
        "His sceptre shows the force of temporal power,",
        "The attribute to awe and majesty,",
        "Wherein doth sit the dread and fear of kings;"
      ]
    },

    "S4.8": {
      "title": "Lesson S4.8: Speed Test",
      "type": "Paragraph",
      "text": [
        "But mercy is above this scepter'd sway,--",
        "It is enthroned in the heart of kings,",
        "It is an attribute to God himself;",
        "And earthly power doth then show likest God's",
        "When mercy seasons justice.  Therefore, Jew,",
        "Though justice be thy plea consider this--",
        "That in the course of justice none of us",
        "Should see salvation: we do pray for mercy;",
        "And that same prayer doth teach us all to render",
        "The deeds of mercy.  I have spoke thus much",
        "To mitigate the justice of thy plea;",
        "Which if thou follow, this strict court of Venice",
        "Must needs give sentence 'gainst the merchant there."
      ]
    },

    "_comment_5": "# END LESSONS DATA SECTION"
  }
}
